tf2_tools/frames_2026-03-29_00.45.19.gv
digraph G {
"base_footprint" -> "base_link"[label=" Joint: base_joint\nType: fixed\nxyz: 0.0 0 0.25\nrpy: 0 0 0.0\n"];
"base_link" -> "chassis_link"[label=" Joint: chassis_joint\nType: fixed\nxyz: 0 0 0\nrpy: 0 0 0\n"];
"base_link" -> "battery_link"[label=" Joint: battery_joint\nType: fixed\nxyz: -0.2 0 0.02\nrpy: 0 0 0\n"];
"base_link" -> "ur5_base_link"[label=" Joint: ur5_base_joint\nType: fixed\nxyz: 0.2 0 0.72\nrpy: 0 0 0\n"];
"ur5_base_link" -> "ur5_base_link_inertia"[label=" Joint: ur5_base_link-base_link_inertia\nType: fixed\nxyz: 0 0 0\nrpy: 0 0 3.141592653589793\n"];
"ur5_base_link_inertia" -> "ur5_shoulder_link"[label=" Joint: ur5_shoulder_pan_joint\nType: revolute\nxyz: 0 0 0.089159\nrpy: 0 0 0\n"];
"ur5_shoulder_link" -> "ur5_upper_arm_link"[label=" Joint: ur5_shoulder_lift_joint\nType: revolute\nxyz: 0 0 0\nrpy: 1.570796327 0 0\n"];
"ur5_upper_arm_link" -> "ur5_forearm_link"[label=" Joint: ur5_elbow_joint\nType: revolute\nxyz: -0.425 0 0\nrpy: 0 0 0\n"];
"ur5_forearm_link" -> "ur5_wrist_1_link"[label=" Joint: ur5_wrist_1_joint\nType: revolute\nxyz: -0.39225 0 0.10915\nrpy: 0 0 0\n"];
"ur5_wrist_1_link" -> "ur5_wrist_2_link"[label=" Joint: ur5_wrist_2_joint\nType: revolute\nxyz: 0 -0.09465 -1.941303950897609e-11\nrpy: 1.570796327 0 0\n"];
"ur5_wrist_2_link" -> "ur5_wrist_3_link"[label=" Joint: ur5_wrist_3_joint\nType: revolute\nxyz: 0 0.0823 -1.688001216681175e-11\nrpy: 1.570796326589793 3.141592653589793 3.141592653589793\n"];
"ur5_wrist_3_link" -> "ur5_ft_frame"[label=" Joint: ur5_wrist_3_link-ft_frame\nType: fixed\nxyz: 0 0 0\nrpy: 3.141592653589793 0 0\n"];
"ur5_base_link" -> "ur5_base"[label=" Joint: ur5_base_link-base_fixed_joint\nType: fixed\nxyz: 0 0 0\nrpy: 0 0 3.141592653589793\n"];
"ur5_wrist_3_link" -> "ur5_flange"[label=" Joint: ur5_wrist_3-flange\nType: fixed\nxyz: 0 0 0\nrpy: 0 -1.5707963267948966 -1.5707963267948966\n"];
"ur5_flange" -> "ur5_tool0"[label=" Joint: ur5_flange-tool0\nType: fixed\nxyz: 0 0 0\nrpy: 1.5707963267948966 0 1.5707963267948966\n"];
"ur5_tool0" -> "robotiq_85_base_link"[label=" Joint: robotiq_85_base_joint\nType: fixed\nxyz: 0 0 0\nrpy: 0 0 0\n"];
"robotiq_85_base_link" -> "robotiq_85_left_knuckle_link"[label=" Joint: robotiq_85_left_knuckle_joint\nType: revolute\nxyz: 0.03060114 0.0 0.05490452\nrpy: 0 0 0\n"];
"robotiq_85_base_link" -> "robotiq_85_right_knuckle_link"[label=" Joint: robotiq_85_right_knuckle_joint\nType: fixed\nxyz: -0.03060114 0.0 0.05490452\nrpy: 0 0 0\n"];
"robotiq_85_left_knuckle_link" -> "robotiq_85_left_finger_link"[label=" Joint: robotiq_85_left_finger_joint\nType: fixed\nxyz: 0.03152616 0.0 -0.00376347\nrpy: 0 0 0\n"];
"robotiq_85_right_knuckle_link" -> "robotiq_85_right_finger_link"[label=" Joint: robotiq_85_right_finger_joint\nType: fixed\nxyz: -0.03152616 0.0 -0.00376347\nrpy: 0 0 0\n"];
"robotiq_85_base_link" -> "robotiq_85_left_inner_knuckle_link"[label=" Joint: robotiq_85_left_inner_knuckle_joint\nType: fixed\nxyz: 0.0127 0.0 0.06142\nrpy: 0 0 0\n"];
"robotiq_85_base_link" -> "robotiq_85_right_inner_knuckle_link"[label=" Joint: robotiq_85_right_inner_knuckle_joint\nType: fixed\nxyz: -0.0127 0.0 0.06142\nrpy: 0 0 0\n"];
"robotiq_85_left_finger_link" -> "robotiq_85_left_finger_tip_link"[label=" Joint: robotiq_85_left_finger_tip_joint\nType: fixed\nxyz: 0.00563134 0.0 0.04718515\nrpy: 0 0 0\n"];
"robotiq_85_right_finger_link" -> "robotiq_85_right_finger_tip_link"[label=" Joint: robotiq_85_right_finger_tip_joint\nType: fixed\nxyz: -0.00563134 0.0 0.04718515\nrpy: 0 0 0\n"];
"base_link" -> "front_left_wheel"[label=" Joint: front_left_wheel_joint\nType: fixed\nxyz: 0.35 0.25 -0.21\nrpy: 0 0 0\n"];
"base_link" -> "front_right_wheel"[label=" Joint: front_right_wheel_joint\nType: fixed\nxyz: 0.35 -0.25 -0.21\nrpy: 0 0 0\n"];
"base_link" -> "back_left_wheel"[label=" Joint: back_left_wheel_joint\nType: fixed\nxyz: -0.35 0.25 -0.21\nrpy: 0 0 0\n"];
"base_link" -> "back_right_wheel"[label=" Joint: back_right_wheel_joint\nType: fixed\nxyz: -0.35 -0.25 -0.21\nrpy: 0 0 0\n"];
"base_link" -> "middle_left_wheel"[label=" Joint: middle_left_wheel_joint\nType: continuous\nxyz: 0 0.28 -0.17\nrpy: 0 0 0\n"];
"base_link" -> "middle_right_wheel"[label=" Joint: middle_right_wheel_joint\nType: continuous\nxyz: 0 -0.28 -0.17\nrpy: 0 0 0\n"];
"base_link" -> "L_F_Lidar_Link"[label=" Joint: L_F_Lidar_joint\nType: fixed\nxyz: 0.4 0.25 0.07\nrpy: 3.1416 0 0.7854\n"];
"base_link" -> "R_B_Lidar_Link"[label=" Joint: R_B_Lidar_joint\nType: fixed\nxyz: -0.4 -0.25 0.07\nrpy: -3.1416 0 -2.3562\n"];
"base_link" -> "imu_frame"[label=" Joint: imu_joint\nType: fixed\nxyz: 0.0 0.0 0.08\nrpy: 0.0 0.0 0.0\n"];
"base_link" -> "kinect_camera"[label=" Joint: kinect_camera_joint\nType: fixed\nxyz: 0.48 0 0.14\nrpy: 0 0 0\n"];
"kinect_camera" -> "kinect_camera_optical"[label=" Joint: kinect_camera_optical_joint\nType: fixed\nxyz: 0 0 0\nrpy: -1.5707963267948966 0 -1.5707963267948966\n"];
"base_link" -> "rear_camera"[label=" Joint: rear_camera_joint\nType: fixed\nxyz: -0.48 0 0.14\nrpy: 0 0 3.141592653589793\n"];
"rear_camera" -> "rear_camera_optical"[label=" Joint: rear_camera_optical_joint\nType: fixed\nxyz: 0 0 0\nrpy: -1.5707963267948966 0 -1.5707963267948966\n"];
"base_link" -> "stereo_camera"[label=" Joint: stereo_camera_joint\nType: fixed\nxyz: 0.48 0 0.14\nrpy: 0 0 0\n"];
"stereo_camera" -> "stereo_camera_optical"[label=" Joint: stereo_camera_optical_joint\nType: fixed\nxyz: 0 0 0\nrpy: -1.5707963267948966 0 -1.5707963267948966\n"];
edge [style=invis];
 subgraph cluster_legend { style=bold; color=black; label ="view_frames Result";
"Recorded at time: 1774719919.9721591"[ shape=plaintext ] ;
}->"base_footprint";
}
